IRP/src/Catalogs/Stores/Stores.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Stores</name>
  <attributes>
    <name>UseGoodsReceipt</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseShipmentConfirmation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Transit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

IRP/src/AccumulationRegisters/GoodsInTransitIncoming/GoodsInTransitIncoming.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>GoodsInTransitIncoming</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ReceiptBasis</name>
    <type>
      <types>DefinedType.typeReceiptBasis</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/GoodsInTransitOutgoing/GoodsInTransitOutgoing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>GoodsInTransitOutgoing</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ShipmentBasis</name>
    <type>
      <types>DefinedType.typeShipmentBasis</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Catalogs/Stores/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	IDInfoServer.OnCreateAtServer(ThisObject, "GroupContactInformation");
EndProcedure

&AtClient
Procedure UseGoodsReceiptOnChange(Item)
	If Not Object.UseGoodsReceipt  And ValueIsFilled(Object.Ref) Then
		If СheckGoodsInTransitIncoming() Then
			Object.UseGoodsReceipt = True;
		 	ThisObject.Modified = False;
		 	ShowMessageBox(, StrTemplate(R().Error_053, String(Object.Ref)));
		 EndIf;
	EndIf;
EndProcedure

&AtClient
Procedure UseShipmentConfirmationOnChange(Item)
	If Not Object.UseShipmentConfirmation And ValueIsFilled(Object.Ref) Then
		 If СheckGoodsInTransitOutgoing() Then
		 	Object.UseShipmentConfirmation = True;
		 	ThisObject.Modified = False;
		 	ShowMessageBox(, StrTemplate(R().Error_052, String(Object.Ref)));
		 EndIf;
	EndIf;
EndProcedure

&AtServer
Function СheckGoodsInTransitIncoming()
	
	Query = New Query;
	Query.Text =
		"SELECT TOP 1
		|	GoodsInTransitIncoming.ReceiptBasis
		|FROM
		|	AccumulationRegister.GoodsInTransitIncoming AS GoodsInTransitIncoming
		|WHERE
		|	GoodsInTransitIncoming.Store = &Store";
	
	Query.SetParameter("Store", Object.Ref);
	
	Return Not Query.Execute().IsEmpty();
	
EndFunction

&AtServer
Function СheckGoodsInTransitOutgoing()
	Query = New Query;
	Query.Text =
		"SELECT TOP 1
		|	GoodsInTransitOutgoing.ShipmentBasis
		|FROM
		|	AccumulationRegister.GoodsInTransitOutgoing AS GoodsInTransitOutgoing
		|WHERE
		|	GoodsInTransitOutgoing.Store = &Store";
	
	Query.SetParameter("Store", Object.Ref);
	
	Return Not Query.Execute().IsEmpty();
EndFunction


&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

#Region IDInfo

&AtClient
Procedure IDInfoOpening(Item, StandardProcessing) Export
	IDInfoClient.IDInfoOpening(Item, StandardProcessing, Object, ThisObject);
EndProcedure

&AtClient
Procedure StartEditIDInfo(Result, Parameters) Export
	IDInfoClient.StartEditIDInfo(ThisObject, Result, Parameters);
EndProcedure

&AtClient
Procedure EndEditIDInfo(Result, Parameters) Export
	IDInfoClient.EndEditIDInfo(Object, Result, Parameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	IDInfoClient.NotificationProcessing(ThisObject, Object.Ref, EventName, Parameter, Source);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	IDInfoServer.AfterWriteAtServer(ThisObject, CurrentObject, WriteParameters);
EndProcedure

#EndRegion
